# ___

# [ Machine Learning in Geosciences ]

**Department of Applied Geoinformatics and Carthography, Charles University** 

*Lukas Brodsky lukas.brodsky@natur.cuni.cz*

    
___

## Python Pandas 

In this Pandas tutorial we will learn how to use Python Pandas package for data analysis. In this section, you should go through these topics:

* Series
* DataFrames
* Missing Data
* Data Input and Output

The first main data type we will learn about for pandas is the `Series` **data type**. Let's import Pandas and explore the Series object.

A *Series is very similar to a NumPy array* (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have **axis labels**, meaning it can be **indexed** by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

In [1]:
import numpy as np
import pandas as pd

C:\Users\uzivatel\AppData\Local\Temp\ipykernel_14680\1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

## Object Creation

### Creating a Series

One can convert a list, numpy array, or dictionary to a pandass `Series`. 

`class pandas.Series(data=None, index=None, ...)` is a one-dimensional ndarray with axis labels (including time series). Labels need not be unique but must be a hashable type. The object supports both integer- and label-based indexing.

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

**Using Lists**

In [3]:
pd.Series(data=my_list)
# pandas records are indexed, vytvoříme jeden sloupcový vektor

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
# arguments are positional
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

**NumPy Arrays**

In [6]:
pd.Series(arr)
# pro vícedimenzionální array to je trochu problém a většinou definujeme, který sloupec to má použít

0    10
1    20
2    30
dtype: int32

**Dictionary**

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas `Series` can hold a variety of object types:

In [8]:
pd.Series(data=labels)
# můžu tomu cpát i textík, yay

0    a
1    b
2    c
dtype: object

In [9]:
# Even functions, although unlikely that you will use this!
pd.Series([sum,print,len])
# můžu tomu nacpat třeba i class, ale kdo ví, k čemu by to bylo :D

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its `index`. Pandas makes use of these index names or numbers by allowing for **fast look ups of information** (works like a hash table or dictionary).

Here is an examples of how to get information from a Series.

In [10]:
ser1 = pd.Series([1,2,3,4], index = ['Czech Republic', 'Germany', 'Slovak Republic', 'Japan'])

In [11]:
ser1

Czech Republic     1
Germany            2
Slovak Republic    3
Japan              4
dtype: int64

In [12]:
ser1['Slovak Republic']

3

___

# DataFrames

Pandas DataFrames are directly inspired by the *R programming language*. We can think of a **DataFrame as a set of `Series` objects** put together to share the same index.

In [13]:
from numpy.random import randn
np.random.seed(101)

`class pandas.DataFrame(data=None, index: Optional[Collection] = None, ...)` is two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns). Arithmetic operations align on both row and column labels. Can be thought of as a dict-like container for Series objects. The primary pandas data structure.

Here we create Pandas `DataFrame` of size (5, 4) filled with random numbers. 

`index` specifies the reords; `columns` specifies the attributes of the DataFrame.

In [14]:
# když chceme víc slupoečků
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Use the various methods to get data from a DataFrame.

In [15]:
# Getting, indexuju (hledám) pomocí názvu sloupečku
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [16]:
# Pass a list of column names, dvojitý závorky!!
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [17]:
# SQL Syntax (not recommended!), nefunguje to na všechny metody
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [18]:
type(df['W'])

pandas.core.series.Series

In [ ]:
# Selecting via [], which slices the rows.

Recommend is the optimized pandas data access methods, `.at`, `.iat`, `.loc` and `.iloc`.

In [19]:
# Selecting on a multi-axis by label:
df.loc[['A','B'],['W']]

# nejdřív vyberu řádky a pak sloupce

          W
A  2.706850
B  0.651118

In [20]:
# Selecting one 
df.loc['A','W']

2.706849839399938

In [21]:
# Selection by position: vybere to druhý řádek
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [22]:
# By integer slices, acting similar to numpy/python:
df.iloc[0:2]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [23]:
# For getting a value explicitly:
df.iloc[1, 1]

-0.31931804459303326

In [24]:
# For getting fast access to a scalar (equivalent to the prior method):
df.iat[1, 1]

-0.31931804459303326

**Creating a new column:**

In [25]:
df['new'] = df['W'] + df['Y']

In [26]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**Removing Columns**

In [27]:
df.drop('new',axis=1)
# axis=1 když mažu sloupec
# axis=0 když mažu řádek

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [29]:
df.drop('new',axis=1,inplace=True)

# aby se to uložilo, tak tam musím dát to inplace nebo to uložit do něčeho
# df = df.drop('new',axis=1)

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# Can also drop rows this way:

df.drop('E',axis=0)

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [33]:
# vrátí mi to hodnoty, pro které to platí, jinak to vyplní NaN
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
# vrať mi řádky, kde je W>0
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
# pro řádky, kde je W>0 mi vrať hodnoty Y
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [38]:
# pro řádky, kde je W>0 mi vrať hodnoty Y a X, zase bacha na dvojitý závorky
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [ ]:
''' jako to předchozí:
SELECT Y 
FROM df
WHERE W > 0
'''

For two conditions you can use `|` and `&` with parenthesis!

In [39]:
# possibly adjust the conditions according to random numbers in the df to select at least one record. 

df[(df['W'] > 0) & (df['Y'] < 0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

___

##  More of Index 

Here are some more features of indexing, including resetting the index or setting it something else; also the index hierarchy!

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [42]:
# rozsekám string podle mezer
newind = 'CZ SK DE AT PL'.split()

In [43]:
df['States'] = newind

In [44]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CZ
B  0.651118 -0.319318 -0.848077  0.605965     SK
C -2.018168  0.740122  0.528813 -0.589001     DE
D  0.188695 -0.758872 -0.933237  0.955057     AT
E  0.190794  1.978757  2.605967  0.683509     PL

In [45]:
# nastavíme to jako nové indexy, ale bez inplace se to zase neuloží, he he
df.set_index('States')

               W         X         Y         Z
States
CZ      2.706850  0.628133  0.907969  0.503826
SK      0.651118 -0.319318 -0.848077  0.605965
DE     -2.018168  0.740122  0.528813 -0.589001
AT      0.188695 -0.758872 -0.933237  0.955057
PL      0.190794  1.978757  2.605967  0.683509

In [46]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CZ
B  0.651118 -0.319318 -0.848077  0.605965     SK
C -2.018168  0.740122  0.528813 -0.589001     DE
D  0.188695 -0.758872 -0.933237  0.955057     AT
E  0.190794  1.978757  2.605967  0.683509     PL

In [47]:
# apply the change inplace 

df.set_index('States', inplace=True)

In [48]:
df

               W         X         Y         Z
States
CZ      2.706850  0.628133  0.907969  0.503826
SK      0.651118 -0.319318 -0.848077  0.605965
DE     -2.018168  0.740122  0.528813 -0.589001
AT      0.188695 -0.758872 -0.933237  0.955057
PL      0.190794  1.978757  2.605967  0.683509

___

# Missing Data

In case of missing data we can remove such records or fill in ...

In [49]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]})

In [50]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [51]:
# vymaže všechny řádky, kde je Nan
df.dropna()

     A    B  C
0  1.0  5.0  1

In [52]:
# vymaže explicitně všechny řádky, kde je Nan
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [53]:
# vymaže explicitně všechny sloupce, kde je Nan
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [54]:
# thresh int, optional; Require that many non-NA values.
# vymaže řádky, kde je dvakrát Nan

df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [55]:
# NaN nahradí jinou hodnotou
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [56]:
# fill in statistical value, be carefull with such practice! 
# ve sloupci A nahradí NaN hodnoty průměřem ze sloupce A

df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### View Data

In [57]:
# vytiskne první řádky
df.head()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [58]:
# vytiskne první tři řádky
df.head(3)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [60]:
# vytiskne řádky od konce
df.tail(1)

    A   B  C
2 NaN NaN  3

In [61]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [62]:
# převeden dataframe na array
df.to_numpy()

array([[ 1.,  5.,  1.],
       [ 2., nan,  2.],
       [nan, nan,  3.]])

In [64]:
nparr = df.to_numpy()
my_df = pd.DataFrame(nparr)

In [65]:
type(my_df)

pandas.core.frame.DataFrame

In [66]:
my_df

     0    1    2
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

___

# Data Input and Output

This section is the reference code for getting input and output. Pandas can read a variety of file types using its `pd.read_` methods. 

The pandas I/O API is a set of top level reader functions accessed like `pandas.read_csv()` that generally return a pandas object. The corresponding writer functions are object methods that are accessed like `DataFrame.to_csv()`.

[Pandas IO](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)

## CSV

### CSV Input

`pandas.read_csv(filepath, ...)` read a comma-separated values (csv) file into DataFrame. Also supports optionally iterating or breaking of the file into chunks.

In [68]:
# read an example csv file placed in the same directory as the *.ipynb 
df = pd.read_csv('housing.csv')

In [69]:
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

### CSV Output

In [70]:
df.to_csv('example_out.csv', index=False)

## Excel

Pandas can read and write excel files. Keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [ ]:
# Install xlrd >= 0.9.0 for Excel support
# pd.read_excel('excel_example.xlsx',sheetname='Sheet1')

## HTML

Pandas can read HTML. One may need to install htmllib5,lxml, and BeautifulSoup4. 
These packages can be installed by Conda/Minicond:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Use pip install in case your Python is not from the Anaconda Distribution. 

To make it running in Jupyter, you need to restart the Notebook.

### HTML Input
Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [ ]:
# TBD prepare HTML data in table
# df = pd.read_html('http://...')

In [ ]:
# df

### SQL 

Pandas reads data from the database.

The `pandas.io.sql` module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by **SQLAlchemy** if installed. In addition you will need a driver library for your database. Examples of such drivers are **psycopg2 for PostgreSQL** or **pymysql for MySQL**. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.

If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

Read SQL database table into a DataFrame.

`read_sql_table(table_name, con[, schema, ...])`

Read SQL query into a DataFrame.

`read_sql_query(sql, con[, index_col, ...])`

Read SQL query or database table into a DataFrame.

`read_sql(sql, con[, index_col, ...])`

Write records stored in a DataFrame to a SQL database.
    
`DataFrame.to_sql(name, con[, flavor, ...])`

In [72]:
from sqlalchemy import create_engine

In [73]:
engine = create_engine('sqlite:///:memory:')

In [74]:
df.to_sql('data', engine)

20640

In [75]:
sql_df = pd.read_sql('data',con=engine)

In [76]:
sql_df

,index,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...,...
20635,20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND